Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.PourMarkPropertyElementTypes Class
 The PourMarkPropertyElementTypes class represents the available property element types for pour marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class PourMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class PourMarkPropertyElementTypes
The PropertyElement.PropertyElementType.PourMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Class
Returns the class property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
PourConcreteMixture
Returns the contrete mixture property element type.
PourNumber
Returns the pour number property element type.
PourType
Returns the pour type property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace